src/InformationRegisters/ИсторияОбменовПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменовПоОбъектам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменовПоОбъектам/Ext/ManagerModule.bsl
Процедура СоздатьЗаписиПоСообщению(ДанныеСообщения, ТаблицаИсторииОбъектов) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияОбменовПоОбъектам.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.НомерСообщения.Установить(ДанныеСообщения.НомерСообщения);
	НаборЗаписей.Отбор.Исходящее.Установить(ДанныеСообщения.Исходящее);
	НаборЗаписей.Отбор.Узел.Установить(ДанныеСообщения.Узел);
	НаборЗаписей.Отбор.ДатаСообщения.Установить(ДанныеСообщения.Период);
	
	// 05.04.19 Строганов Роман > 
	НаборЗаписей.Прочитать();
	// 05.04.19 Строганов Роман <
	
	Для Каждого СтрокаТаблицы Из ТаблицаИсторииОбъектов Цикл  
	
		ЗаписьНабора = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеСообщения,,"Период, ХранилищеСообщения");
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаТаблицы);
		
		ЗаписьНабора.ДатаСообщения      = ДанныеСообщения.Период;		
		ЗаписьНабора.ХранилищеСообщения = Новый ХранилищеЗначения(СтрокаТаблицы.ТелоСообщения, Новый СжатиеДанных(9));
				
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
		
	
КонецПроцедуры

Функция СоздатьТаблицуДляИсторииОбъектов() Экспорт
	
	ТаблицаИстории = Новый ТаблицаЗначений;
	
	ТаблицаИстории.Колонки.Добавить("Период");
	ТаблицаИстории.Колонки.Добавить("Объект");
	ТаблицаИстории.Колонки.Добавить("ТелоСообщения");
	ТаблицаИстории.Колонки.Добавить("Ошибка");
	ТаблицаИстории.Колонки.Добавить("ТекстОшибки");
	ТаблицаИстории.Колонки.Добавить("ИмяМетаданных");
	
	Возврат ТаблицаИстории;
	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуИсторииОбъектов(ТаблицаИстории, Объект, ТелоСообщения, Ошибка=Ложь, ТекстОшибки="", ИмяМетаданных="") Экспорт
	
	Если ТаблицаИстории = Неопределено Тогда 
		Возврат;	
	КонецЕсли;
	
	СтрокаИстории = ТаблицаИстории.Добавить();
	
	СтрокаИстории.Период = ТекущаяДата();
	СтрокаИстории.Объект = Объект;
	ОбъектЭтоСсылка = Ложь;
	ТипОбъекта = ТипЗнч(Объект);
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипОбъекта)
		ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда 
		
		ОбъектЭтоСсылка = Истина;
		Если НЕ ЗначениеЗаполнено(Объект.ВерсияДанных) Тогда  
			СтрокаИстории.Объект = Строка(Объект.УникальныйИдентификатор());
		КонецЕсли;		
	КонецЕсли;
	
	ТекстСообщения = ТелоСообщения;
	Если ТипЗнч(ТелоСообщения) = Тип("ДокументDOM") Тогда 
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку("UTF-8");
		ЗаписьDOM = Новый ЗаписьDOM;
		ЗаписьDOM.Записать(ТелоСообщения,ЗаписьXML);
		ТекстСообщения = ЗаписьXML.Закрыть();
	ИначеЕсли ТипЗнч(ТелоСообщения) = Тип("ОбъектXDTO") Тогда 
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку("UTF-8");
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ТелоСообщения);
		ТекстСообщения = ЗаписьXML.Закрыть();
	КонецЕсли;
	СтрокаИстории.ТелоСообщения = ТекстСообщения;
	СтрокаИстории.Ошибка        = Ошибка;
	СтрокаИстории.ТекстОшибки   = ТекстОшибки;
		
	Если ИмяМетаданных = "" И ОбъектЭтоСсылка Тогда 
		СтрокаИстории.ИмяМетаданных = Объект.Метаданные().ПолноеИмя();
	Иначе
		СтрокаИстории.ИмяМетаданных = ИмяМетаданных;
	КонецЕсли;
	
КонецПроцедуры
